const questionsPartOne = [
    {id:1,question:'آیا شناختن شما',answer:[
        {op:'الف',text:'آسان است',socres:[{e:1,i:0}]},
        {op:'ب',text:'دشوار است',socres:[{e:0,i:2}]}
    ]},

    {id:2,question:'آیا',answer:[
        {op:'الف',text:'با هر کسی تا حدی که لازم میدانید به راحتی صحبت میکنید؟',socres:[{e:2,i:0}]},
        {op:'ب',text:'فقط با افراد خاصی آن هم در شرایط خاصی میتوانید زیاد صحبت کنید؟',socres:[{e:0,i:2}]}
    ]},

    {id:3,question:'شما معمولا',answer:[
        {op:'الف',text:'زود جوش هستید؟',socres:[{e:2,i:0}]},
        {op:'ب',text:'آرام و درون گرا هستید؟',socres:[{e:0,i:2}]}
    ]},
    {id:4,question:'روابط دوستانه شما',answer:[
        {op:'الف',text:'با افرادی معدود ولی عمیق است؟',socres:[{e:0,i:0}]},
        {op:'ب',text:'با تعداد بسیاری از افراد ولی سطحی است؟',socres:[{e:1,i:0}]}
    ]},
    {id:5,question:'میتوانید به طور نامحدود',answer:[
        {op:'الف',text:'فقط با کسانی که علایق مشترکی با شما دارند صحبت کنید؟',socres:[{e:0,i:1}]},
        {op:'ب',text:'میتوانید تقریبا با هر کسی صحبت کنید؟',socres:[{e:2,i:0}]}
    ]},
    {id:6,question:'در صحبت کردن با دوستانتان',answer:[
        {op:'الف',text:'گاهی مسائل شخصی را به طور خصوصی به آنان میگویید؟',socres:[{e:1,i:0}]},
        {op:'ب',text:'تقریبا هرگز چیزی را که نمی خواهید بگویید بیان نمیکنید؟',socres:[{e:0,i:2}]}
    ]},
    {id:7,question:'آیا معمولا',answer:[
        {op:'الف',text:'آزادانه احساسات خود را نشان میدهید؟',socres:[{e:2,i:0}]},
        {op:'ب',text:'احساسات خود را نشان نمیدهید؟',socres:[{e:0,i:2}]}
    ]},
    {id:8,question:'وقتی غریبه ها به شما توجه می کنند',answer:[
        {op:'الف',text:'احساس ناراحتی میکنید؟',socres:[{e:0,i:1}]},
        {op:'ب',text:'اصلا ناراحت نمیشوید؟',socres:[{e:0,i:0}]}
    ]},
    {id:9,question:'آیا عادت دارید',answer:[
        {op:'الف',text:'به هیچ کس اعتماد نکنید یا حداکثر به یک نفر اعتماد کنید؟',socres:[{e:0,i:0}]},
        {op:'ب',text:'تعدادی دوست دارید که به آنها اعتماد میکنید؟',socres:[{e:1,i:0}]}
    ]},
    {id:10,question:'آیا',answer:[
        {op:'الف',text:'فکر میکنید همه ی کسانی را که دوست دارید میدانند که دوستشان دارید',socres:[{e:0,i:0}]},
        {op:'ب',text:'به بعضی افراد علاقه مند هستید بی آنکه بگذارید آنها بدانند؟',socres:[{e:0,i:1}]}
    ]},
    {id:11,question:'وقتی با گروهی از افراد هستید معمولا ترجیح میدهید؟',answer:[
        {op:'الف',text:'به صحبت گروهی بپردازید؟',socres:[{e:2,i:0}]},
        {op:'ب',text:'هر بار فقط با یک فرد صحبت کنید؟',socres:[{e:0,i:2}]}
    ]},
    {id:12,question:'در بین دوستانتان آیا',answer:[
        {op:'الف',text:'یکی از آخرین کسانی هستید که خبرها را میشنوید؟',socres:[{e:0,i:2}]},
        {op:'ب',text:'همه نوع خبری در مورد هر کسی دارید؟',socres:[{e:2,i:0}]}
    ]},
    {id:13,question:'در یک محفل اجتماعی',answer:[
        {op:'الف',text:'سعی می کنید کسی را که دوست دارید با او صحبت کنید به گوشه ای بکشید؟',socres:[{e:0,i:2}]},
        {op:'ب',text:'با گروه میجوشید؟',socres:[{e:1,i:0}]}
    ]},
    {id:14,question:'در میهمانی ها',answer:[
        {op:'الف',text:'گاهی کسل میشوید؟',socres:[{e:0,i:1}]},
        {op:'ب',text:'همیشه به شما خوش میگذرد؟',socres:[{e:2,i:0}]}
    ]},
    {id:15,question:'کدام لغت برای شما جالبتر است ؟',answer:[
        {op:'الف',text:'صحبت کردن',socres:[{e:0,i:0}]},
        {op:'ب',text:'نوشتن',socres:[{e:0,i:1}]}
    ]},
    {id:16,question:'کدام لغت برای شما جالبتر است ؟',answer:[
        {op:'الف',text:'آرام',socres:[{e:0,i:1}]},
        {op:'ب',text:'سرزنده',socres:[{e:2,i:0}]}
    ]},
    {id:17,question:'کدام لغت برای شما جالبتر است ؟',answer:[
        {op:'الف',text:'ساکت',socres:[{e:0,i:2}]},
        {op:'ب',text:'پر حرف',socres:[{e:2,i:0}]}
    ]},
    {id:18,question:'در یک مهمانی دوست دارید:',answer:[
        {op:'الف',text:'کاری کنید که مراسم به خوبی برگزار شود؟',socres:[{e:2,i:0}]},
        {op:'ب',text:'میگذارید هر کسی به میل خودش خوش بگذراند؟',socres:[{e:0,i:1}]}
    ]},
    {id:19,question:'هنگامی که با گروهی از دوستان نزدیک خودتان هستید:',answer:[
        {op:'الف',text:'بیشتر از بقیه صحبت میکنید؟',socres:[{e:2,i:0}]},
        {op:'ب',text:'کمتر از بقیه؟',socres:[{e:0,i:2}]}
    ]},
    {id:20,question:'در یک گروه بزرگ اغلب:',answer:[
        {op:'الف',text:'دیگران را معرفی میکنید؟',socres:[{e:2,i:0}]},
        {op:'ب',text:'معرفی میشوید؟',socres:[{e:0,i:2}]}
    ]},
    {id:21,question:'زمانی که در مورد یک پیشامد فکر میکنید ترجیح میدهید:',answer:[
        {op:'الف',text:'در این مورد با شخصی صحبت کنید؟',socres:[{e:1,i:0}]},
        {op:'ب',text:'در مورد آن خوب فکر میکنید؟',socres:[{e:0,i:1}]}
    ]},
    {id:22,question:'آیا افرادی که تازه با شما آشنا میشوند میتوانند بگویند به چه علاقه دارید؟',answer:[
        {op:'الف',text:'خیلی سریع',socres:[{e:2,i:0}]},
        {op:'ب',text:'تنها پس از آنکه شما را خوب شناختند',socres:[{e:0,i:0}]}
    ]},
    {id:23,question:'آیا معمولا منظورتان',answer:[
        {op:'الف',text:'بیشتر از آنچه میگویید میباشد؟',socres:[{e:1,i:0}]},
        {op:'ب',text:'کمتر از آنچه میگویید است؟',socres:[{e:0,i:2}]}
    ]},
    {id:24,question:'وقتی که غریبه ها را ملاقات میکنید',answer:[
        {op:'الف',text:'برایتان خوشایند یا دست کم راحت است؟',socres:[{e:1,i:0}]},
        {op:'ب',text:'زحمت زیادی برایتان دارد؟',socres:[{e:0,i:2}]}
    ]},
    {id:25,question:'وقتی در جلسه ای راجع به چیزی نظری دارید که باید گفته شود',answer:[
        {op:'الف',text:'آن را مطرح میکنید؟',socres:[{e:1,i:0}]},
        {op:'ب',text:'در مورد گفتن آن تردید دارید؟',socres:[{e:0,i:1}]}
    ]},

];


const questionPartTwo = [
    {id:26,question:'ترجیح میدهید در نظر مردم چگونه باشید؟',answer:[
        {op:'الف',text:'فردی اهل عمل؟',socres:[{s:2,n:0}]},
        {op:'ب',text:'فردی مبتکر و خلاق؟',socres:[{s:0,n:2}]}
    ]},
    {id:27,question:'هنگام مطالعه با هدف سرگرم شدن آیا',answer:[
        {op:'الف',text:'از شیوهی بیان عجیب و ابتکاری مطالب لذت می برید؟',socres:[{s:0,n:1}]},
        {op:'ب',text:'نویسندگانی را دوست دارید که به روشنی منظور خود را میرسانید؟',socres:[{s:1,n:0}]}
    ]},
    {id:28,question:'اگر معلم بودید ترجیح میدادید',answer:[
        {op:'الف',text:'واقعیت ها را تدریس کنید؟',socres:[{s:2,n:0}]},
        {op:'ب',text:'نظریه ها را شرح دهید؟',socres:[{s:0,n:2}]}
    ]},
    {id:29,question:'معمولا با کدام شخص راحت تر ارتباط برقرار میکنید؟',answer:[
        {op:'الف',text:'با فردی تخیلی؟',socres:[{s:0,n:2}]},
        {op:'ب',text:'با فردی واقع بین؟',socres:[{s:2,n:0}]}
    ]},
    {id:30,question:'در انجام کاری که بسیاری از مردم انجام میدهند ترجیح میدهید',answer:[
        {op:'الف',text:'آن را به شیوه ی پذیرفته شده انجام دهید؟',socres:[{s:2,n:0}]},
        {op:'ب',text:'روش خاص خود را برای انجام آن ابداع کنید؟',socres:[{s:0,n:1}]}
    ]},
    {id:31,question:'درشیوه ی زندگی تان ترجیح می دهید',answer:[
        {op:'الف',text:'متفاوت باشید؟',socres:[{s:0,n:1}]},
        {op:'ب',text:'متعارف عمل کنید؟',socres:[{s:2,n:0}]}
    ]},
    {id:32,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'عبارت',socres:[{s:2,n:0}]},
        {op:'ب',text:'مفهوم',socres:[{s:0,n:1}]}
    ]},
    {id:33,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'ساختن',socres:[{s:2,n:0}]},
        {op:'ب',text:'اختراع کردن',socres:[{s:0,n:1}]}
    ]},
    {id:34,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'واقعی',socres:[{s:2,n:0}]},
        {op:'ب',text:'انتزاعی',socres:[{s:0,n:2}]}
    ]},
    {id:35,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'حروفی',socres:[{s:1,n:0}]},
        {op:'ب',text:'ارقامی',socres:[{s:0,n:1}]}
    ]},
    {id:36,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'تولید',socres:[{s:2,n:0}]},
        {op:'ب',text:'طراحی',socres:[{s:0,n:2}]}
    ]},
    {id:37,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'علامت',socres:[{s:0,n:0}]},
        {op:'ب',text:'نماد',socres:[{s:0,n:0}]}
    ]},
    {id:38,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'پذیرش',socres:[{s:1,n:0}]},
        {op:'ب',text:'تغییر',socres:[{s:0,n:1}]}
    ]},
    {id:39,question:'کدام لغت برای شما جالب تر است؟',answer:[
        {op:'الف',text:'شناخته شده',socres:[{s:0,n:0}]},
        {op:'ب',text:'ناشناخته',socres:[{s:0,n:2}]}
    ]},
    {id:40,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'واقعیت ها',socres:[{s:2,n:0}]},
        {op:'ب',text:'ایده ها',socres:[{s:0,n:1}]}
    ]},
    {id:41,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'زیربنا',socres:[{s:0,n:0}]},
        {op:'ب',text:'روبنا',socres:[{s:0,n:2}]}
    ]},
    {id:42,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'نظریه',socres:[{s:0,n:1}]},
        {op:'ب',text:'تجربه',socres:[{s:0,n:0}]}
    ]},
    {id:43,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'مایع',socres:[{s:0,n:1}]},
        {op:'ب',text:'جامد',socres:[{s:2,n:0}]}
    ]},
    {id:44,question:'کدام یک تمجید بیشتری از یک فرد است؟',answer:[
        {op:'الف',text:'بصیرت دارد؟',socres:[{s:0,n:2}]},
        {op:'ب',text:'عقل سلیم دارد؟',socres:[{s:2,n:0}]}
    ]},

];


const questionPartThree = [
    {id:45,question:'اگر بخواهید در همسایگی خود برای مسائلی مانند کمک به کمیته امداد به جمع آوری اعانه بپردازید',answer:[
        {op:'الف',text:'درخواست شما خلاصه و تجاری است؟',socres:[{t:1,f:0}]},
        {op:'ب',text:'دوستانه و اجتماعی است؟',socres:[{t:0,f:0}]}
    ]},
    {id:46,question:'کدام گزاره تعریف و تمجید بیشتری از شما به شمار می آید؟',answer:[
        {op:'الف',text:'شخصی با احساسات واقعی؟',socres:[{t:0,f:1}]},
        {op:'ب',text:'شخصی همیشه منطقی؟',socres:[{t:2,f:0}]}
    ]},
    {id:47,question:'آیا در تصمیم گیری، بیشتر',answer:[
        {op:'الف',text:'قلبتان بر عقلتان غلبه دارد؟',socres:[{t:0,f:1}]},
        {op:'ب',text:'عقلتان بر قلبتان؟',socres:[{t:1,f:0}]}
    ]},
    {id:48,question:'هنگام گفتگو بیشتر تمایل دارید',answer:[
        {op:'الف',text:'تمجید کنید؟',socres:[{t:0,f:0}]},
        {op:'ب',text:'سرزنش کنید؟',socres:[{t:1,f:0}]}
    ]},
    {id:49,question:'احساس میکنید که کدام یک عیب بدتری به شمار میآید؟',answer:[
        {op:'الف',text:'همدردی نکردن؟',socres:[{t:0,f:1}]},
        {op:'ب',text:'استدلال پذیر نبودن؟',socres:[{t:0,f:0}]}
    ]},
    {id:50,question:'اگر بخواهید عمل خاصی را انجام دهید کدام یک از این دو گزاره برایتان جالب تر بنظر میآید؟',answer:[
        {op:'الف',text:'مردم خیلی دوست دارند که شما آن را انجام دهید؟',socres:[{t:0,f:1}]},
        {op:'ب',text:'این منطقی ترین کاري است که انجام میدهید؟',socres:[{t:0,f:0}]}
    ]},
    {id:51,question:'فکر میکنید وجود کدام یک در فرد نقص بیشتری است؟',answer:[
        {op:'الف',text:'خیلی احساساتی بودن؟',socres:[{t:1,f:0}]},
        {op:'ب',text:'به اندازه کافی احساساتی نبودن؟',socres:[{t:0,f:0}]}
    ]},
    {id:52,question:'احساس میکنید کدام یک عیب بدتری به شمار میآید؟',answer:[
        {op:'الف',text:'گرمی زیاد نشان دادن؟',socres:[{t:1,f:0}]},
        {op:'ب',text:'به اندازه کافی گرم نبودن؟',socres:[{t:0,f:0}]}
    ]},
    {id:53,question:'آیا معمولا',answer:[
        {op:'الف',text:'برای احساس بیشتر از منطق ارزش قائل هستید؟',socres:[{t:0,f:2}]},
        {op:'ب',text:'برای منطق بیشتر از احساس؟',socres:[{t:2,f:0}]}
    ]},
    {id:54,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'متقاعد کردن',socres:[{t:2,f:0}]},
        {op:'ب',text:'لمس کردن',socres:[{t:0,f:2}]}
    ]},
    {id:55,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'موافقت کردن',socres:[{t:0,f:1}]},
        {op:'ب',text:'پرسیدن',socres:[{t:1,f:0}]}
    ]},
    {id:56,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'مزایا',socres:[{t:1,f:0}]},
        {op:'ب',text:'برکت',socres:[{t:0,f:1}]}
    ]},
    {id:57,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'تحلیل کردن',socres:[{t:2,f:0}]},
        {op:'ب',text:'همدردی',socres:[{t:0,f:2}]}
    ]},
    {id:58,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'نرم',socres:[{t:0,f:0}]},
        {op:'ب',text:'سخت',socres:[{t:0,f:2}]}
    ]},
    {id:59,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'پایبند به اندیشه خود',socres:[{t:2,f:0}]},
        {op:'ب',text:'دلگرم',socres:[{t:0,f:0}]}
    ]},
    {id:60,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'چه کسی؟',socres:[{t:0,f:0}]},
        {op:'ب',text:'چه چیزی؟',socres:[{t:1,f:0}]}
    ]},
    {id:61,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'محتاط',socres:[{t:2,f:0}]},
        {op:'ب',text:'خوش خیال',socres:[{t:0,f:0}]}
    ]},
    {id:62,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'ملایم',socres:[{t:0,f:1}]},
        {op:'ب',text:'محکم',socres:[{t:2,f:0}]}
    ]},
    {id:63,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'عدالت',socres:[{t:0,f:0}]},
        {op:'ب',text:'بخشندگی',socres:[{t:0,f:2}]}
    ]},
    {id:64,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'غیر انتقادی',socres:[{t:0,f:1}]},
        {op:'ب',text:'انتقادی',socres:[{t:1,f:0}]}
    ]},
    {id:65,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'متفکر',socres:[{t:2,f:0}]},
        {op:'ب',text:'احساسی',socres:[{t:0,f:2}]}
    ]},
    {id:66,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'دلسوزی',socres:[{t:0,f:1}]},
        {op:'ب',text:'دوراندیشی',socres:[{t:2,f:0}]}
    ]},
    {id:67,question:'بیشتر مراقب کدام یک هستید؟',answer:[
        {op:'الف',text:'احساسات افراد؟',socres:[{t:0,f:0}]},
        {op:'ب',text:'حقوق افراد؟',socres:[{t:2,f:0}]}
    ]},
    {id:68,question:'آیا به طور طبیعی:',answer:[
        {op:'الف',text:'به مردم بیشتر از اشیاء علاقه مندید؟',socres:[{t:0,f:0}]},
        {op:'ب',text:'به اشیاء و نحوه کار آنها بیشتر از روابط انسان ها علاقه مندید؟',socres:[{t:2,f:0}]}
    ]},  
];

const questionPartFour = [
    {id:69,question:'برای انجام یک کار، آیا',answer:[
        {op:'الف',text:'آن را زود شروع میکنید بطوریکه پس از پایان کار وقت اضافی داشته باشید؟',socres:[{j:0,p:0}]},
        {op:'ب',text:'آن را به لحظه آخر واگذار کرده و سعی میکنید هر چه سریعتر انجام دهید؟',socres:[{j:0,p:2}]}
    ]},
    {id:70,question:'هنگامی که رخدادی پیش بینی نشده شما را مجبور به کنار گذاشتن برنامه روزانه تان می نماید',answer:[
        {op:'الف',text:'آیا بوجود آمدن وقفه در برنامه تان را مزاحمت تلقی می نمایید؟',socres:[{j:1,p:0}]},
        {op:'ب',text:'با تغییر وضعیت بوجود آمده با خوشرویی برخورد میکنید؟',socres:[{j:0,p:1}]}
    ]},
    {id:71,question:'آیا مطابق برنامه عمل کردن',answer:[
        {op:'الف',text:'مورد رضایت شماست؟',socres:[{j:2,p:0}]},
        {op:'ب',text:'شما را در تنگنا قرار می دهد؟',socres:[{j:0,p:2}]}
    ]},
    {id:72,question:'هنگام شروع یک پروژه ی بزرگ که تا یک هفته باید انجام شود',answer:[
        {op:'الف',text:'زمانی را برای تهیه فهرستی از کارهایی که میبایست انجام شوند بر اساس اولویت در نظر میگیرید؟',socres:[{j:1,p:0}]},
        {op:'ب',text:'دل به دریا می زنید و شروع میکنید؟',socres:[{j:0,p:2}]}
    ]},
    {id:73,question:'اگر قرار باشد که کاری خاص را از پیش در زمانی خاص انجام دهید',answer:[
        {op:'الف',text:'طبق برنامه عمل کردن برای شما خوشایند است؟',socres:[{j:1,p:0}]},
        {op:'ب',text:'از در چهار چوب قرار گرفتن احساس ناخوشایندی میکنید؟',socres:[{j:0,p:2}]}
    ]},
    {id:74,question:'آیا ترجیح می دهید',answer:[
        {op:'الف',text:'قرار ملاقات ها، وعدهها و میهمانی ها را از پیش تعیین کنید؟',socres:[{j:2,p:0}]},
        {op:'ب',text:'فردی باشید که در لحظه آخر بتوانید آزادانه آنجایی را که تمایل دارید انتخاب کنید؟',socres:[{j:0,p:2}]}
    ]},
    {id:75,question:'آیا',answer:[
        {op:'الف',text:'ترجیح میدهید کارها را در دقیقه آخر انجام دهید؟',socres:[{j:0,p:2}]},
        {op:'ب',text:'انجام دادن کارها در دقیقه آخر شما را عصبی میکند؟',socres:[{j:2,p:0}]}
    ]},
    {id:76,question:'آیا فکر میکنید که داشتن یک برنامه روزانه',answer:[
        {op:'الف',text:'راحت ترین روش برای دادن کارهاست؟',socres:[{j:1,p:0}]},
        {op:'ب',text:'حتی اگر ضروری باشد رنج آور است؟',socres:[{j:0,p:2}]}
    ]},
    {id:77,question:'وقتی که کار خاصی برای انجام دادن دارید آیا مایلید',answer:[
        {op:'الف',text:'پیش از آغاز کار، با دقت آن را سازماندهی کنید؟',socres:[{j:2,p:0}]},
        {op:'ب',text:'آنچه ضروری است را حین انجام کار متوجه شوید؟',socres:[{j:0,p:2}]}
    ]},
    {id:78,question:'آیا',answer:[
        {op:'الف',text:'روزمره بودن برایتان ساده تر است؟',socres:[{j:0,p:1}]},
        {op:'ب',text:'متنوع بودن؟',socres:[{j:1,p:0}]}
    ]},
    {id:79,question:'در زندگی شخصی وقتی به پایان مسئولیتی میرسید',answer:[
        {op:'الف',text:'آیا میدانید کار بعدی چیست و آماده درگیر شدن با آن هستید؟',socres:[{j:2,p:0}]},
        {op:'ب',text:'تا پیشامد بعدی از آرامش خود خوشنود هستید؟',socres:[{j:0,p:1}]}
    ]},
    {id:80,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'وقت شناس',socres:[{j:1,p:0}]},
        {op:'ب',text:'بی دغدغه',socres:[{j:0,p:2}]}
    ]},
    {id:81,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'منضبط',socres:[{j:2,p:0}]},
        {op:'ب',text:'آسان گیر',socres:[{j:0,p:0}]}
    ]},
    {id:82,question:'کدام لغت برای شما جالبتر است؟',answer:[
        {op:'الف',text:'منظم',socres:[{j:2,p:0}]},
        {op:'ب',text:'خودمانی',socres:[{j:0,p:1}]}
    ]},
    {id:83,question:'کدام لغت برای شما جالبتر است ؟',answer:[
        {op:'الف',text:'برنامه ریز',socres:[{j:2,p:0}]},
        {op:'ب',text:'بی برنامه',socres:[{j:0,p:2}]}
    ]},
    {id:84,question:'آیا به طور کلی ترجیح میدهید:',answer:[
        {op:'الف',text:'برای دیدار کسی از قبل برنامه ریزی کنید؟',socres:[{j:2,p:0}]},
        {op:'ب',text:'آزاد باشید و لحظه ای عمل کنید؟',socres:[{j:0,p:2}]}
    ]},
    {id:85,question:'وقتی برای یک روز جایی میروید، آیا ترجیح میدهید:',answer:[
        {op:'الف',text:'برای اینکه چه کاری و چه موقع انجام دهید برنامه ریزی کنید؟',socres:[{j:2,p:0}]},
        {op:'ب',text:'فقط میروید؟',socres:[{j:0,p:2}]}
    ]},
    {id:86,question:'در مورد کارهای روز مره ترجیح میدهید',answer:[
        {op:'الف',text:'ابتدای صبح همه کارها را انجام دهید؟',socres:[{j:1,p:0}]},
        {op:'ب',text:'در ضمن فرصت پیش آمده حین انجام کارهای جالب آنها را انجام میدهید؟',socres:[{j:0,p:1}]}
    ]},
    {id:87,question:'آیا',answer:[
        {op:'الف',text:'از اتمام کارها پیش از زمان موعود احساس رضایت میکنید؟',socres:[{j:1,p:0}]},
        {op:'ب',text:'از سرعت و کارآمدی خود در لحظات آخر انجام کار لذت میبرید؟',socres:[{j:0,p:2}]}
    ]},
    
];




const mbtiResults = [{
    id: 1,
    name: 'ISTJ',
    summeryInfo: ['حسی درون گرا با متفکر برون گرا', 'احساسی', 'شهودی برون گرا'],
    moreInfo: [
       'ماهیت فنی داشته باشد و به فرد امکان دهد که از توانمندیهایش استفاده کند.',
       'محصول یا خدمتی واقعی ارائه دهد و ترجیحا از روشهای استاندارد در آن استفاده شود.',
       ' بتواند مستقل عمل کند و برای تکمیل آن از نیروی عالی تمرکز خود استفاده نماید.',
       ' بتواند کار را در محیطی با ثبات و سنتی انجام دهد و ریسکهای غیر ضروری نیاز نباشد.',
       'دارای نتایج ملموس و قابل اندازه گیری باشد.',
       'دارای هدفهای عینی روشن و ساختار سازمانی مشخص و تعریف شده باشد.',
       ' فرد فرصت کافی برای آماده کردن خود داشته باشد.',
       ' به فرد مسئولیتهای بیش از پیش و فزاینده بدهد.',
       ' کار در محیطی انجام شود که به داوری و تجربههای فرد بهای کافی داده شود.',
       ' به فرد امکان بدهد که به هدفهای تعیین شده برسد و نتایج کافی را در اختیار فرد قرار دهد',
    ],
    jobs: [
       'تجارت و بازرگانی',
       'فروش و خدمات',
       'امور مالی',
       'تحصیلات و آموزش',
       'حقوقی تکنولوژی',
       'مراقبتهای بهداشتی',
    ]
 },
 {
    id: 2,
    name: 'ISFJ',
    summeryInfo: ['حسی درون گرا با احساسی برون گرا','متفکر','شهودی برون گرا'],
    moreInfo: [
        ' نیازمند مشاهده و دقت باشد، تا فرد با توانمندی خود بتواند به حقایق و جزئیات آن توجه کند',
        'به فرد امکان دهد روی پروژههای ملموس کار کند و به دیگران کمک کند.',
        ' به فرد امکان ابراز محبت را بدهد و شرایط پی بردن دیگران به تلاش او را فراهم سازد.',
        'به شکل سنتی و در محیطی سازمان یافته انجام شود.',
        ' شرایطی فراهم سازد که فرد به روشهای استاندارد توجه کرده و از داوریهای عملی استفاده کند',
        'به فرد امکان دهد که در هر لحظه روی یک پروژه یا یک شخص کار کند.',
        ' به فرد فضای کاری خصوصی بدهد تا بتواند به تنهایی کار کند.',
        'بتواند به دیگران کمک کند و یا با کسانی کار کند که در باورها و ارزشهای او سهیم باشند.',
        'شرایطی فراهم سازد که فرد سازمان یافته و کارآمد شود.',
        ' لازم نباشد که فرد کارش را مرتب در حضور دیگران ارائه دهد.',
    ],
    jobs: [
        'مراقبتهای درمانی و بهداشتی',
        'تجارت خدمات',
        'کارهای خلاق فنی',
        'خدمات اجتماعی آموزشی',
    ]
 },
 {
    id: 3,
    name: 'ESTP',
    summeryInfo: ['حسی برون گرا با متفکر درون گرا','احساسی','شهودی درون گرا'],
    moreInfo: [
        'بتواند با دیگران در ارتباط باشد، هر روز با موقعیت جدیدی روبرو شود و سرگرمی داشته باشد.',
        ' بتواند از قدرت مشاهده و توجه خود برای کسب اطلاعات و حفظ آنها استفاده کند.',
        ' بتواند برای مسایل و مشکلات راه حلهایی پیدا کند.',
        'کار پویا، پر ماجرا و تفریحی باشد که در ان حوادث به سرعت اتفاق بیفتد و فرد بتواند تصمیمگیری کند.',
        ' بتواند در موقعیتهای برنامه ریزی نشده از روشهای غیر متعارف استفاده کند و به راه حلهای منطقی برسد',
        ' بتواند در شرایطی که مقررات وجود ندارد کار کند و با همکارانی شاداب و فعال سرو کار داشته باشد.',
        ' شخصا اقدام به سازماندهی کند و لزوما مطابق معیارها و استانداردهای دیگران رفتار نکند.',
        ' علمی و منطقی باشد و فرد بتواند از توانمندیهای استدلالی و عقلی خود استفاده کند.',
        ' بتواند آزادانه با بحرانها روبرو شود.',
        'با واقعیتها سروکار داشته باشد نه با نظریههای مجرد، تا فرد بتواند با تلاشهایش به نتایج ملموس برسد.',
    ],
    jobs: [
        'تجارت و بازرگانی',
        'فروش خدمات',
        'امور مالی',
        'تجارت کارهای دستی',
        'سرگرمی ورزش',
    ]
 },
 {
    id: 4,
    name: 'ESFP',
    summeryInfo: ['حسی برون گرا با احساسی درون گرا','متفکر','شهودی درون گرا'],
    moreInfo: [
        ' امکان یادگیری از تجارب را فراهم سازد، تا اطلاعات لازم را جمعآوری و به حل مسئله اقدام نماید.',
        ' امکان دخالت شخص در مسایل را فراهم سازد، تا بتواند با مشتریان و مراجعان مستقیما صحبت کند',
        ' فرد در کارش تفریح و استقلال داشته باشد و بتواند با اشخاص مختلفی سروکار داشته باشد',
        ' بتواند با مهارت با اشخاص و با مشکلات آنها روبرو شود و از تنش آنها بکاهد.',
        ' امکان فعالیتهای مختلف وجود داشته باشد.',
        'بتواند در طول روز با اشخاص مختلفی که شور و اشتیاق او را دارند، همکاری کند.',
        ' بتواند به پروژههای که زودبازده هستند بپردازد و نیازهای اشخاص مختلف را برآورده سازد.',
        ' امکان کار کردن در محیطی آرام و دوستانه فراهم باشد',
        'تلاش بیشتر پاداش داشته باشد و فرد احساس کند به خاطر کارش از او قدردانی می شود.',
        ' حداقل بوروکراسی در کار باشد و فرد از کارش لذت ببرد و خودش باشد.',
    ],
    jobs: [
        'آموزش خدمات اجتماعی',
        'سرگرمی تفریحی',
        'تجارت فروش',
        'مراقبتهای بهداشتی و سلامتی',
        'خدمات',
        'علوم',
    ]
 },

 {
    id: 5,
    name: 'INTJ',
    summeryInfo: ['شهودی درون گرا با متفکر برون گرا','احساسی','حسی برون گرا'],
    moreInfo: [
        'به فرد امکان بدهد راه حلهای مبتکرانه حل مسایل را پیدا کند تا سیستمهای موجود را بهبود بخشد.',
        ' امکان صرف انرژی در انجام ایدههای خوب را فراهم سازد، تا به شکل منطقی فعالیت داشته باشد.',
        'امکان کار کردن با اشخاصی را که فرد به تخصص، هوش و صلاحیت آنها احترام میگذارد، فراهم سازد.',
        ' به فرد به خاطر نقطه نظرهایش اعتبار بدهد و امکان اجرای آنها را فراهم سازد.',
        'امکان کار کردن مستقل را به فرد بدهد و بتواند با افراد آگاه تبادل نظر داشته باشد.',
        ' فرد را در جریان اطلاعات جدید قرار دهد، تا بتواند بر توانمندیها و صلاحیتهای خود بیفزاید.',
        'به فرد امکان بدهد کار و تولیدی فراهم آورد که با معیارهای بالای او همخوانی داشته باشد.',
        'حالت تکراری نداشته باشد.',
        'به فرد استقلال و اختیار فراوان بدهد تا تغییراتی را ایجاد کرده و به رشد اشخاص و سیستمها کمک کند',
        'همخوان با معیارهای بالا باشد و منصفانه زحمات فرد را جبران کند.',
    ],
    jobs: [
        'تجارت امور مالی',
        'مراقبتهای بهداشتی پزشکی',
        'آموزش',
        'تکنولوژی',
        'رشتههای حرفه ای',
        'فعالیتهای خلاق',
    ]
 },
 {
    id: 6,
    name: 'INFJ',
    summeryInfo: ['شهودی درون گرا با احساسی برون گرا','متفکر','حسی برون گرا'],
    moreInfo: [
        ' به فرد امکان بدهد روی ایدهها و نقطه نظرهایی کار کند که به رشد و تعالی دیگران کمک کند.',
        'به فرد امکان بدهد محصولات و خدماتی تولید کند که به آنها اعتقاد دارد و احساس افتخار میکند.',
        'به مالکیت فرد و تلاشهای منحصر به فردی که میتواند داشته باشد توجه کند و به آنها بها دهد.',
        'به فرد اجازه دهد که خود را ابراز کند و پنداره خود را ببیند.',
        'به فرد اجازه دهد از ایدههای خود برای یاری رساندن به دیگران استفاده کند.',
        'به فرد اجازه دهد تا بتواند کارش را در محیطی دوستانه و عاری از تنش انجام دهد.',
        'بتواند مستقل کار کند، ولی نظراتش را در محیطی دوستانه با دیگران در میان بگذارد.',
        ' به فرد امکان بدهد که اوقات و محیط کار خود را سازماندهی کند و روی جریان کار کنترل داشته باشد',
        ' به فرد امکان بدهد تا نقطه نظرهایش را جمع بندی و پردازش کند و در آمادگی مطلوب قرار بگیرد',
        'با باورهای فرد هماهنگ باشد و به او امکان دهد از کمال شخصی و حرفهای خوب برخوردار باشد.',
    ],
    jobs: [
        'مشاوره آموزش',
        'امور بازرگانی و تجارتی',
        'کارهای خلاق',
        'مراقبتهای بهداشتی خدمات اجتماعی',
        'تکنولوژی',
        'مذهب',
    ]
 },
 {
    id: 7,
    name: 'ENTP',
    summeryInfo: ['شهودی برون گرا با متفکر درون گرا','احساسی','حسی درون گرا'],
    moreInfo: [
        'به فرد امکان بدهد تا دست به اقدامات خلاق بزند و راه حلهای جدید برای مسایل پیدا کند.',
        'بتواند راه حلهای خلاق خود را برای ایجاد سیستمهای عملکردی کاراتر مورد استفاده قرار دهد.',
        ' خلاقیت فرد تایید و تشویق شود.',
        'به فرد امکان دهد موقعیتهای مختلفی را تجربه کند که پر از لذت و تفریح و هیجان باشد.',
        'از نظمی منطقی برخوردار باشد و از معیارها و استانداردهای منصفانه استفاده کند.',
        ' به فرد امکان دهد تا با اشخاص مختلف بخصوص افراد محترم ملاقات و تبادل نظر داشته باشد.',
        ' به فرد امکان بدهد تا تواناییهای شخصی و شغلی خود را بالا ببرد و بتواند با اشخاص توانمند مرتبط باشد',
        ' بتواند در شرایط دنیای متحول و متغیر، موثر واقع شود.',
        'بتواند در محیطی دوستانه و سازمان نیافته عمل کند. جایی که بتواند در آن آزادی عمل فراوان داشته باشد',
        'به فرد امکان بدهد تا پروژههای نو طراحی کند، ولی مجبور نباشد به جزئیات مسایل بها بدهد.'
    ],
    jobs: [
        'بازاریابی امور بدیع و ابتکاری',
        'تجارت کارفرمایی',
        'برنامه ریزی و توسعه',
    ],
 },
 {
    id: 8,
    name: 'ENFP',
    summeryInfo: ['شهودی برون گرا با احساسی درون گرا','متفکر','حسی درون گرا'],
    moreInfo: [
        ' به فرد امکان بدهد با گروههای متنوعی روی موضوعات مختلف کار کند.',
        ' به فرد امکان بدهد تا ایدهها، خدمات یا راه حلهای نو برای مسایلی که به دیگران کمک میکند پیدا کند.',
        'خوشایند، چالش برانگیز و همیشه از تنوعی برخوردار باشد.',
        'به ندرت لازم باشد که فرد در جزئیات کار شرکت کند.',
        'به فرد امکان دهد به سرعت روی موضوعات کار کند،آزادی عمل داشته باشد تا ارادهاش را نشان دهد.',
        ' به فرد امکان دهد تا با اشخاص جدیدی آشنا شود، مهارتهای جدیدی بیاموزد و کنجکاوی خود را ارضا کند.',
        ' با ارزشهای فرد سازگار باشد، به او امکان دهد فرصتهای مناسب به سود دیگران فراهم آورد.',
        ' بتواند کار را در محیطی دوستانه و آرام انجام دهد و با دیگران در شرایط حداقل تعارض باشد.',
        'به فرد امکان بدهد تا از الهامات خود تبعیت کند و در کارهای جالب و هیجان بخش مشارکت کند.',
        ' کار در فضایی انجام شود که تشکر به همراه داشته باشد و به شور و شوق و خلاقیت فرد بیافزاید.',
    ],
    jobs: [
        'بازاریابی برنامه ریزی',
        'آموزش مشاوره',
        'کارفرمایی تجارت',
        'مراقبتهای بهداشتی خدمات اجتماعی',
        'تکنولوژی',
        'کارهای خلاق',
    ]
 },
 {
    id: 9,
    name: 'ISTP',
    summeryInfo: ['متفکر درون گرا با حسی برون گرا','شهودی','احساسی برون گرا'],
    moreInfo: [
        ' بتواند منابعی را شناسایی و به کاراترین شکل ممکن از آنها بهره برداری کند.',
        ' به فرد امکان بدهد مهارتهایی را بیاموزد تا بتواند در آنها به استادی برسد و از آنها استفاده نماید',
        'به فرد امکان بدهد تا از علمی که کسب کرده استفاده نماید و با آن مشکلات دیگران را حل کند.',
        'دارای جهات روشن و واضح باشد و فرد بتواند با محصولات واقعی در تماس باشد.',
        'تفریحی و پویا باشد تا فرصت داشته باشد که از محیط بسته کار خارج شود و قدمی در دل طبیعت بگذارد',
        ' در محیطی که عاری از مقررات مفصل و دست و پا گیر است، کار کند.',
        'بتواند مستقل کار کند و نظارت دیگران روی او حداقل و نظارت او هم روی دیگران کم باشد.',
        'به فرد فرصت کافی بدهد تا به علایق و سرگرمیهایش برسد.',
        ' به فرد شادی و لذت بدهد و پیوسته چالش دار باشد.',
        ' بی نیاز از کارهای روزمره با مقررات زیاد باشد.',
    ],
    jobs: [
        'خدمات بهداشتی و درمانی',
        'امور مالی تجارت',
        'فروش خدمات',
        'تجارت کارهای دستی',
        'تکنولوژی',
    ]
 },

 {
    id: 10,
    name: 'INTP',
    summeryInfo: ['متفکر درون گرا با شهودی برون گرا','حسی','احساسی برون گرا'],
    moreInfo: [
        'به فرد اجازه دهد ایدههای جدیدی ارائه دهد و آنها را نقد و تحلیل کند.',
        ' به فرد امکان بدهد انرژی خود را در جریان خلاقیت به کار گیرد و صرفا به نتیجه کار نظر نداشته باشد.',
        'به فرد فرصت دهد تا مستقل کار کند. وقت کافی داشته باشد که بطور خصوصی کارهایش را انجام دهد',
        'با مسایل پیچیده رو به رو باشد تا خارج از روشهای متعارف فرد را به چالش برانگیزد.',
        ' بتواند با انعطاف کافی انجام دهد وقواعد بی موعد سدی در برابر وی ایجاد نکند.',
        ' به فرد امکان دهد تا از استانداردها و معیارهای خود در کارها استفاده کند.',
        ' به فرد امکان دهد با گروه کوچک اما واجد شرایط و با صلاحیت کارها را انجام دهد.',
        ' به فرد امکان دهد تا ایدههای خلاق ارائه دهد و انجام کارها را به دیگران محول کند.',
        ' به فرد امکان دهد که شایستگیهای خود را افزایش دهد و با اشخاص با صلاحیت در تماس باشد.',
        'نیازی به این نداشته باشد که مستقیما اوقات خود را صرف سازماندهی سایرین بکند.',
    ],
    jobs: [
        'مراقبتهای بهداشتی فنی',
        'حرفهای تجاری',
        'کارهای خلاق',
        'کامپیوتر تکنولوژی',
    ]
 },

 {
    id: 11,
    name: 'ESTJ',
    summeryInfo: ['متفکر برون گرا با حسی درون گرا','شهودی','احساسی درون گرا'],
    moreInfo: [
        'به فرد امکان دهد سازمان یافته کار کند و از وقت خود به شکل موثر در رسیدن به نتیجه منطقی استفاده کند.',
        'به فرد امکان بدهد تا از مهارتهایش استفاده کند و از قدرت فکری و استدلالی خود سود جوید.',
        'دستاوردهای کار به شکلی منطقی قابل اندازه گیری باشد.',
        ' در محیطی دوستانه انجام شود و همکارانی سخت کوش و با وجدان داشته باشد.',
        'بتوان از آن انتظارات روشن داشت.',
        'ماهیتی واقع بینانه ‚ ملموس و کاربردهای عملی داشته باشد و نتایج شخصی بر جای بگذارد',
        'به فرد امکان دهد که مولد و کارا باشد، بتواند اقدامات لازم را سازماندهی کند، از روشها و اصول شخصی پیروی کند. ضرب الاجلهای مشخص داشته باشد تا فرد بتواند در زمان تعیین شده کارش را انجام دهد.',
        'بتواند در محیط و شرایط قابل پیش بینی کار کند.',
        ' بتواند کار را با اشخاص دیگری انجام دهد. به فرد امکان دهد تا برخود و همکاران مسلط باشد.',
        ' به فرد امکان تصمیمگیری بدهد تا بتواند مسئولیتهای فراوان بر عهده بگیرد و کار را کنترل بکند.',
    ],
    jobs: [
        'فروش و خدمات',
        'تکنولوژی فیزیکال',
        'مدیریت',
        'کارهای حرفه ای',
    ]
 },

 {
    id: 12,
    name: 'ENTJ',
    summeryInfo: ['متفکر برون گرا با شهودی درون گرا','حسی','احساسی درون گرا'],
    moreInfo: [
        ' به فرد امکان رهبری بدهد تا کنترل امور دستش باشد.',
        'به فرد امکان برنامه ریزی بلند مدت را بدهد تا بتواند روشهای ابتکاری برای حل مسایل ارائه دهد.',
        'کار در محیطی سازمان یافته انجام شود تا فرد بتواند در محدودهای معین با دیگران کار کند.',
        'کنجکاوی ذهنی فرد را سبب شود و به او امکان دهد با مسایل پیچیده و اغلب دشوار کار کند.',
        'به فرد فرصت دهد با اشخاص لایق و توانمند کار کند.',
        'به فرد امکان دهد در محدوده سازمان رشد کند و بر صلاحیتهای خویش بیفزاید.',
        'جالب، چالش برانگیز و رقابت آمیز باشد، تا حدی که موفقیت،های فرد را دیگران ببینند.',
        'به فرد امکان بدهد با اشخاص هوشمند، خلاق و هدفمند کار کند.',
        'به فرد امکان هدفگذاری بدهد و شرایطی فراهم سازد که با دیگران به هدف اصلی سازمان فکر کنند.',
        ' به فرد امکان دهد که دیگران را مدیریت کند. از معیارهای منطقی استفاده کند و از توانمندیهای دیگران بهره بگیرد.',
    ],
    jobs: [
        'تجارت و بازرگانی',
        'امور مالی',
        'مشاوره آموزش',
        'امور حرفهای',
        'تکنولوژی',
    ]
 },

 {
    id: 13,
    name: 'ISFP',
    summeryInfo: ['احساسی درون گرا با حسی برون گرا','شهودی','متفکر برون گرا'],
    moreInfo: [
        ' با ارزشهای فرد همخوانی داشته باشد.',
        ' بتواند آن را در محیطی حمایتگرانه به اتفاق دیگران انجام دهد.',
        'به جزئیات توجه داشته باشد.',
        'به فرد فرصت دهد مستقل کار کند و در کنارش اشخاصی باشند که با او سازگار باشند.',
        'بتواند سازگار باشد، خود را تطبیق دهد و نتایج کار را تجربه کند.',
        ' به فرد امکان دهد که از سلیقه خودش استفاده کند.',
        'کار در محیطی شاداب و با همکاری دیگران انجام شود',
        ' به فرد امکان بدهد تا به رشد درونی برسد.',
        ' بتواند به سرعت به مسایل رسیدگی کند.',
        ' مجبور نباشد پیوسته برای دیگران سخنرانی کند.',
    ],
    jobs: [
        'کارهای دستی و هنری',
        'مراقبتهای بهداشتی',
        'علوم فنی',
        'فروش خدمات',
    ]
 },

 {
    id: 14,
    name: 'INFP',
    summeryInfo: ['احساسی درون گرا با شهودی برون گرا','حسی','متفکر برون گرا'],
    moreInfo: [
        ' با ارزشها و باورهای فرد هماهنگ باشد و به فرد امکان دهد تا پنداره خود را ابراز دارد',
        'به فرد فرصت دهد که روی جریان و نتیجه کارش کنترل داشته باشد.',
        'بتواند کارش را مستقل و خود مختار انجام دهد. کسی مزاحم کارش نشود و در مواقعی بتواند کارش را به کسانی که احساس میکند به او احترام میگذارند ارائه دهد.',
        'بتواند بطور انعطاف پذیر و با حداقل مقررات و هر وقت احساس راحتی داشت کارش را انجام دهد.',
        'بتواند آن را با افراد با علاقه و خلاق انجام دهد، ترجیح میدهد آن را بدون تنش با دیگران انجام دهد.',
        'بتواند با انجام دادن آن رشد شخصی خود را تشویق کند.',
        'لازم نباشد کار را مرتب به دیگری ارائه دهد یا اینکه قبل از اتمام آن را به دیگران عرضه کند.',
        'به فرد امکان بدهد که از طریق آن به رشد دیگران کمک کند تا به حداکثر توانمندی خود برسد.',
        'لازم باشد که دیگران را درک کند و امکان دهد با اشخاص به طور انفرادی رابطه ایجاد کند.',
        ' به فرد امکان دهد برای دسترسی به ایدهآلهایش تلاش کند و تحت تاثیر مشکلات متوقف نشود',
    ],
    jobs: [
        'خلاق هنری',
        'آموزش￼مشاوره',
        'زمینه های مذهبی',
        'مراقبتهای بهداشتی',
        'متخصص￼علوم اخلاقی',
        'توسعه سازمانی',
        'تکنولوژی',

    ]
 },

 {
    id: 15,
    name: 'ESFJ',
    summeryInfo: ['احساسی برون گرا با حسی درون گرا','شهودی','متفکر درون گرا'],
    moreInfo: [
        ' به فرد امکان دهد با دیگران روابطی صمیمانه داشته باشد و بتواند به تغییر زندگی دیگران کمک کند.',
        'برای دیگران منافعی عملی داشته باشد و به فرد امکان دهد که مهارتهای ضروری را بیاموزد.',
        'به فرد امکان اعمال کنترل بدهد، بتواند با دیگران کار کند و به آنها جهت رسیدن به اهداف کمک کند',
        ' انتظارات روشن و واضح داشته باشد و معیارها و ملاکهای موجود در آن روشن باشد',
        ' در محیطی با حس همکاری مشترک صورت پذیرد. محیطی عاری از هر نوع تعارض',
        'به فرد امکان دهد تا تصمیمگیری کند و از روشهای کارآمد استفاده کند.',
        ' به فرد امکان دهد تا با دیگران تبادل نظر کند و نقشی در تصمیم گیریها داشته باشد.',
        ' به فرد امکان بدهد تا کارش را سازماندهی کند و در این کار به اطرافیان هم کمک کند.',
        ' در محیطی دوستانه انجام گیرد. کار فرد مورد تایید و از موفقیت او تعریف شود.',
        ' با توجه به ساختارها و روشهای موجود انجام شود، و به بالا دست احترام گذاشته شود.',
    ],
    jobs: [
        'مراقبتهای بهداشتی و پزشکی',
        'تحصیلات و آموزش',
        'کارهای کارمندی',
        'کسب و کار تجارت',
        'خدمات اجتماعی مشاورە',
        'فروش خدمات',
    ]
 },

 {
    id: 16,
    name: 'ENFJ',
    summeryInfo: ['احساسی برون گرا با شهودی درون گرا','حسی','متفکر درون گرا'],
    moreInfo: [
        ' به فرد امکان دهد با همکاران، مراجعان، مشتریان روابط گرم و متقابلی داشته باشد.',
        ' به فرد امکان دهد راه حلهای خلاق برای پروژههایش پیدا کند و نتایج مثبت تلاشهایش را ببیند.',
        'کار در محیطی انجام شود که انتظارات در آن روشن باشد و رشد شخصی تشویق شود.',
        ' به فرد اجازه دهد عضوی از تیم سایر اشخاصی باشد که فرد به آنها اعتقاد دارد.',
        ' به فرد امکان دهد که راه حلهای خلاق برای مسایل پیدا کند و آنها را با اشخاص حمایتگر در میان بگذارد.',
        ' فعالیت در محیطی چالش برانگیز انجام شود و به فرد امکان دهد در آن واحد در چند پروژه کار کند.',
        ' به فرد امکان دهد تا از مهارتهای خود استفاده کند و روی پروژههای خود مسئولیت داشته باشد.',
        ' به فرد انواع مختلفی از فعالیتها را بدهد تا به شکلی منظم و برنامهریزی شده از آنها استفاده کند.',
        'فرد را در معرض ایدههای نو قرار دهد و به او امکان دهد تا روشهای نو را بیازماید و به خصوص به روشهایی توجه داشته باشد که زندگی   دیگران را بهبود بخشد',
        ' شغل فرد در محیطی باشد که از تعارض و تنش بین افراد به دور باشد.',
    ],
    jobs: [
        'ارتباطات',
        'امور آموزشی',
        'خدمات انسانی',
        'مراقبتهای بهداشتی',
        'تکنولوژی',
        'بازرگانی مشاوره',
        'مشاوره',
    ]
 },




];

